[M_Orchid_PlotMission04 MissionDefinition]
MissionDescription="Scarlett says that there is only one way to find Captain Blade's lost treasure -- you'll have to collect the four pieces of Blade's compass, and reassemble it. Once you've done that, the compass will (somehow) point the way to the Lost Treasure. Scarlett has one of the pieces, but she needs you to find the others.<br><br>To this end, Scarlett has asked you to find and kill Sandman. Not just because he's a jerk, mind you, but because he has one of the pieces of Blade's compass.  He's somewhere out in [place]Hayter's Folly.[-place]."
TurnInDescription="Scarlett has a piece of Captain Blade's compass. Thanks to your work in retrieving two more pieces from Sandman and the Hyperion caravan, only ONE piece of the compass remains. Better get to it -- you won't be able to track down the Treasure of the Sands until the compass is fully restored."
MissionSummary="Find two pieces of Captain Blade's compass."

[M_Orchid_PlotMission04:DestroyCaravans MissionObjectiveDefinition]
ProgressMessage="Caravans raided"

[M_Orchid_PlotMission04:GetSandmanCompassSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scarlett says that there is only one way to find Captain Blade's lost treasure -- you'll have to collect the four pieces of Blade's compass, and reassemble it. Once you've done that, the compass will (somehow) point the way to the Lost Treasure. Scarlett has one of the pieces, but she needs you to find the others. With Sandman out of the picture, all you need to do is take his compass piece and you'll be one step closer to finding Captain Blade's lost treasure."

[M_Orchid_PlotMission04:KillPirateMinions MissionObjectiveDefinition]
ProgressMessage="Sandman minions killed"

[M_Orchid_PlotMission04:RaidCaravanSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scarlett says that there is only one way to find Captain Blade's lost treasure -- you'll have to collect the four pieces of Blade's compass, and reassemble it. Once you've done that, the compass will (somehow) point the way to the Lost Treasure. Scarlett has one of the pieces, but she needs you to find the others.<br><br>Having just found the second piece of the compass in Sandman's camp, you also discovered the location of the third compass piece. According to Sandman's diary, the third piece is being transported by a Hyperion Supply Convoy in [place]Wurmwater[-place]. Scarlett has asked you to raid the convoy and grab the last compass piece."
